rebet.org
#+TITLE: Rebet.el -- Manage my rebetika collection
#+AUTHOR: dakodeon
#+EMAIL: dakodeon@hotmail.com

* REBET

** OVERVIEW
   
   Organizing things a little bit better each time...

   Each code block will be tangled to a separate file.

   The files will each cover a specific piece of functonality.

** CODE
   
*** Variables

    All the varables used for the package.

    #+NAME: rebet-variables
    #+begin_src emacs-lisp :tangle "rebet-variables.el" :comments link
    ;;; rebet-variables

    ;;; Code:

    (defvar rebet-default-dir "~/Music/Ρεμπέτικα"
      "The default directory where songs are stored.")

    (defvar rebet-dirs-list nil
      "An optional list of additional directories where rebetika are stored,
			besides `rebet-default-dir', eg some download dir.
			Optionally, you can include the value of
			`rebet-default-dir` for consistency.")

    (defvar rebet-lyrics-file "~/stixoi.org"
      "The default file for rebetika lyrics.
	  It should be an org file.")

    (defvar rebet--ref-file "~/Music/Ρεμπέτικα/.ref-list"
      "Where to store the reference list used for searching and
		  building autocomp lists")

    ;; dictionary -- NOTE: cmd-opt is deprecated
    (setplist 'rebet--title
	      '(tagname "title" propname "ITEM"
			val nil cmd-opt "-t " eye-opt "--title "))
    (setplist 'rebet--composer
	      '(tagname "composer" propname "ΣΥΝΘΕΤΗΣ"
			val nil cmd-opt "-c " eye-opt "--text-frame=TCOM:" autocomp-lst nil))
    (setplist 'rebet--artist
	      '(tagname "artist" propname "ΤΡΑΓΟΥΔΙΣΤΗΣ"
			val nil cmd-opt "-a " eye-opt "--artist " autocomp-lst nil))
    (setplist 'rebet--rhythm
	      '(tagname "rhythm" propname "ΡΥΘΜΟΣ"
			val nil cmd-opt "-r " eye-opt "--text-frame=rhythm:" autocomp-lst nil))
    (setplist 'rebet--dromos
	      '(tagname "dromos" propname "ΔΡΟΜΟΣ"
			val nil cmd-opt "-d " eye-opt "--text-frame=dromos:" autocomp-lst nil))
    (setplist 'rebet--tone
	      '(tagname "tone" propname "ΤΟΝΟΣ"
			val nil cmd-opt "-n " eye-opt "--text-frame=tone:" autocomp-lst
			("Ντο" "Ντο#" "Ρε" "Ρε#" "Μι" "Φα" "Φα#" "Σολ" "Σολ#" "Λα" "Λα#" "Σι")))
    (setplist 'rebet--year
	      '(tagname "date" propname "ΕΤΟΣ_ΗΧΟΓΡ"
			val nil cmd-opt "-y " eye-opt "--release-year "))

    (defvar rebet--attributes
      '(rebet--title rebet--composer rebet--artist
		     rebet--rhythm rebet--dromos rebet--tone rebet--year))

    (provide 'rebet-variables)
    ;;; rebet-varables.el ends here
    #+end_src

*** Fetch and write ID3 tags

    The backbone of the package. These functions use the ffprobe and eyeD3
    programs to fetch and set ID3 tags respectively. They are defined here
    together, as most of other functions will use one of these.

    #+NAME: rebet-backbone
    #+begin_src emacs-lisp :tangle "rebet-backbone.el" :comments link
    ;;; Code:

    (defun rebet--get-data-from-id3 (path)
      "Returns an alist based on the ID3 tags of file in PATH."
      (mapcar (lambda (x)
		(let ((pair (split-string x "=" t "TAG:")))
		  (cons (car pair) (nth 1 pair))))
	      (seq-remove (lambda (str) (string-match-p "FORMAT" str))
			  (process-lines
			   "ffprobe" "-loglevel" "error" "-show_entries"
			   "format_tags=title,composer,artist,rhythm,dromos,tone,date"
			   (expand-file-name path)))))

    (defun rebet--set-tags (path val-list)
      "Set the id3 tags of the file in PATH, using values from VAL-LIST.
	   VAL-LIST should be of the form ((<tag> . <value>)).
       Uses the eyeD3 program."
      (let ((optlist (mapcar
		      (lambda (attr)
			(cons (get attr 'eye-opt) (cdr (assoc (get attr 'tagname) val-list))))
		      (seq-remove (lambda (x)
				    (not (cdr (assoc (get x 'tagname) val-list))))
				  rebet--attributes)))
	    (path (expand-file-name path)))
	(shell-command (concat "eyeD3 " (shell-quote-argument path) " "
			       (mapconcat
				(lambda (x)
				  (concat (car x) (shell-quote-argument (cdr x))))
				optlist " ") " >/dev/null"))))

    (provide 'rebet-backbone)

    ;;; rebet-backbone.el ends here
    #+end_src
    
*** Reference file functioality

    The reference file is used to coordinate all the aspects of the
    functionality. It stores a list of file paths, alongside with all ID3
    information associated with these.

    This file is used to provide a quick way of finding a specific piece of
    metadata, without the need to query each file individually, which would
    take considerably more time. Instead, the file is generated once (which
    takes some time to finish) and after that it is updated with each
    change of a file name or tag.

    #+NAME: rebet-ref
    #+begin_src emacs-lisp :tangle "rebet-ref.el" :comments link
    ;;; Code:

    (require 'rebet-variables)
    (require 'rebet-backbone)

    (defun rebet--ref-get-path (ln)
      (if (string-match-p "path" ln)
	  (replace-regexp-in-string "path:" ""
				    (seq-find (lambda (x) (string-match-p "path:" x))
					      (split-string ln "|" t)))))

    (defun rebet--ref-line-format (path var-list)
      "Formats the string to put in ref file."
      (concat "|" (mapconcat
		   (lambda (x) (concat (car x) ":" (cdr x)))
		   var-list "|")
	      "|path:" path))

    (defun rebet--ref-remove-lines (match)
      "Remove lines containing MATCH from ref-file."
      (let ((ref-file (expand-file-name rebet--ref-file)))
	(unless (file-exists-p ref-file)
	  (user-error "Error: the reference file was not found (%s)" ref-file))
	(with-temp-file ref-file
	  (insert-file-contents ref-file)
	  (flush-lines match (point-min) (point-max)))))

    (defun rebet-ref-remove-nonexistent ()
      "Removes entries with non-existent paths from the reference file."
      (interactive)
      (let ((ref-file (expand-file-name rebet--ref-file)))
	(unless (file-exists-p ref-file)
	  (user-error "Error: the reference file was not found (%s)" ref-file))
	(with-temp-file ref-file
	  (insert-file-contents ref-file)
	  (mapc (lambda (ln)
		  (let ((path (rebet--ref-get-path ln)))
		    (message "%s" path)
		    (if path (unless (file-exists-p path)
			       (flush-lines path (point-min) (point-max))))))
		(split-string (buffer-string) "\n")))))

    (defun rebet-mk-ref (&optional path)
      "Writes lines to `rebet--ref-file'. If PATH is not set, it will
      act on every mp3 file in `rebet-default-dir' recursively. If
      PATH is a directory, it will act in all .mp3 files in there,
      non-recursively. If PATH corresponds to a single file, it will
      act only on this file. With a prefix argument it replaces the
      file with the new content.

    For the exact line formatting, see `rebet--ref-line-format'"
      (interactive)
      (let ((ref-file (expand-file-name rebet--ref-file))
	    (path (if (not path)
		      (directory-files-recursively (expand-file-name rebet-default-dir) "mp3")
		    (if (file-directory-p path)
			(directory-files (expand-file-name path) t "mp3")
		      (if (file-exists-p path)
			  (list (expand-file-name path)))))))
	(if current-prefix-arg (delete-file ref-file))
	(if path
	    (with-temp-file ref-file
	      (if (file-exists-p ref-file) (insert-file-contents ref-file))
	      (mapc (lambda (file)
		      (message "%s" file)
		      (flush-lines file (point-min) (point-max))
		      (insert
		       (concat (rebet--ref-line-format file (rebet--get-data-from-id3 file)) "\n")))
		    path)))))

    (defun rebet--make-ref-lists ()
      "Makes the reference lists according to the contents of
	      `rebet--ref-file'."
      (unless (file-exists-p rebet--ref-file)
	(user-error
	 "ERROR: The file \"%s\" does not exist. Run M-x rebet-update-all-refs"
	 rebet--ref-file))
      (with-temp-buffer
	(insert-file-contents (expand-file-name rebet--ref-file))
	(mapc (lambda (attr)
		(put attr 'autocomp-lst
		     (remove
		      ""
		      (delete-dups
		       (mapcar
			(lambda (ln)
			  (let ((rgx (concat "^.*" (get attr 'tagname) ":\\||.*$")))
			    (replace-regexp-in-string rgx "" ln)))
			(split-string (buffer-string) "\n"))))))
	      (seq-remove (lambda (x)
			    (or
			     (not (member 'autocomp-lst (symbol-plist x)))
			     (string= (get x 'tagname) "tone")))
			  rebet--attributes))))

    (provide 'rebet-ref)

    ;;; rebet-ref.el ends here
    #+end_src
    
